* Template
|----------------------------+-------+--------+-------+-----------|
| Configuration              | First | Second | Third | Average   |
|----------------------------+-------+--------+-------+-----------|
| Example with one train     |       |        |       | vmean([]) |
| Example with two trains    |       |        |       | vmean([]) |
| Shared Segment             |       |        |       | vmean([]) |
| Large Network              |       |        |       | vmean([]) |
| Station One                |       |        |       | vmean([]) |
| Station Two                |       |        |       | vmean([]) |
| Station Four               |       |        |       | vmean([]) |
| Station Six                |       |        |       | vmean([]) |
| Station Eight              |       |        |       | vmean([]) |
| Station Ten                |       |        |       | vmean([]) |
| Station Twelfth            |       |        |       | vmean([]) |
| Two trains same direction  |       |        |       | vmean([]) |
| Four trains same direction |       |        |       | vmean([]) |
| Nærumbanen (2T)            |       |        |       | vmean([]) |
|----------------------------+-------+--------+-------+-----------|
#+TBLFM: $5=vmean($2..$4)


* No derailment (Move between connected segments)
** Elapsed time
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.003 |    0.002 |    0.002 | 2.3333333e-3 |
| Example with two trains    |     0.02 |    0.018 |    0.013 |        0.017 |
| Shared Segment             |    0.017 |    0.015 |    0.013 |        0.015 |
| Large Network              |    0.011 |    0.014 |    0.017 |        0.014 |
| Station One                |    0.013 |    0.009 |    0.012 |  0.011333333 |
| Station Two                |    0.074 |    0.076 |    0.075 |        0.075 |
| Station Four               |     1.69 |    1.715 |    1.755 |         1.72 |
| Station Six                |   27.474 |   27.433 |   27.203 |        27.37 |
| Station Eight              |  165.631 |  165.800 |  165.955 |    165.79533 |
| Station Ten                |  601.131 |  602.165 |  600.341 |    601.21233 |
| Station Twelfth            | 1749.956 | 1751.553 | 1724.338 |     1741.949 |
| Two trains same direction  |    0.014 |    0.019 |    0.016 |  0.016333333 |
| Four trains same direction |      DNF |      DNF |      DNF |          DNF |
| Nærumbanen (2T)            |   24.112 |   24.158 |   24.186 |       24.152 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.988 |   5.996 |   6.004 |     5.996 |
| Example with two trains    |   6.512 |   6.528 |   6.538 |     6.526 |
| Shared Segment             |   7.464 |   7.472 |   7.516 |     7.484 |
| Large Network              |   8.928 |   8.960 |   8.972 | 8.9533333 |
| Station One                |   6.472 |   6.492 |   6.500 |     6.488 |
| Station Two                |   9.252 |   9.288 |   9.296 | 9.2786667 |
| Station Four               |  29.580 |  29.672 |  29.688 | 29.646667 |
| Station Six                |  69.912 |  70.192 |  70.200 | 70.101333 |
| Station Eight              | 205.372 | 205.396 | 205.404 | 205.39067 |
| Station Ten                | 313.016 | 313.220 | 313.748 |   313.328 |
| Station Twelfth            | 560.580 | 724.492 | 723.488 |    669.52 |
| Two trains same direction  |   7.488 |   7.496 |   7.540 |     7.508 |
| Four trains same direction |     DNF |     DNF |     DNF |       DNF |
| Nærumbanen (2T)            |  78.428 |  78.824 |  78.828 | 78.693333 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.001 |    0.003 |    0.004 | 2.6666667e-3 |
| Example with two trains    |    0.015 |    0.021 |    0.021 |        0.019 |
| Shared Segment             |    0.009 |    0.014 |     0.02 |  0.014333333 |
| Large Network              |    0.017 |    0.017 |    0.015 |  0.016333333 |
| Station One                |    0.012 |    0.011 |    0.012 |  0.011666667 |
| Station Two                |    0.068 |    0.077 |    0.075 |  0.073333333 |
| Station Four               |    1.679 |    1.723 |    1.721 |    1.7076667 |
| Station Six                |   29.505 |   29.477 |   29.470 |       29.484 |
| Station Eight              |  166.133 |  164.812 |  164.793 |      165.246 |
| Station Ten                |  599.734 |  601.485 |  600.747 |    600.65533 |
| Station Twelfth            | 1744.904 | 1745.973 | 1739.476 |     1743.451 |
| Two trains same direction  |    0.022 |    0.015 |    0.019 |  0.018666667 |
| Four trains same direction |      DNF |      DNF |      DNF |          DNF |
| Nærumbanen (2T)            |   24.004 |   24.091 |   24.111 |    24.068667 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.984 |   5.996 |   5.996 |     5.992 |
| Example with two trains    |   6.500 |   6.512 |   6.516 | 6.5093333 |
| Shared Segment             |   7.460 |   7.464 |   7.468 |     7.464 |
| Large Network              |   8.920 |   8.944 |   8.948 | 8.9373333 |
| Station One                |   6.464 |   6.480 |   6.480 | 6.4746667 |
| Station Two                |   9.252 |   9.276 |   9.280 | 9.2693333 |
| Station Four               |  25.772 |  25.848 |  25.860 | 25.826667 |
| Station Six                |  69.912 |  70.168 |  70.180 | 70.086667 |
| Station Eight              | 158.408 | 158.508 | 158.508 | 158.47467 |
| Station Ten                | 312.992 | 313.008 | 313.132 |   313.044 |
| Station Twelfth            | 559.520 | 559.532 | 559.600 | 559.55067 |
| Two trains same direction  |   7.484 |   7.488 |   7.492 |     7.488 |
| Four trains same direction |     DNF |     DNF |     DNF |       DNF |
| Nærumbanen (2T)            |  78.428 |  78.800 |  78.808 | 78.678667 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.003 |    0.004 |         3e-3 |
| Example with two trains    |    0.022 |    0.024 |    0.015 |  0.020333333 |
| Shared Segment             |    0.014 |    0.014 |    0.014 |        0.014 |
| Large Network              |    0.011 |    0.015 |    0.021 |  0.015666667 |
| Station One                |    0.007 |     0.01 |    0.008 | 8.3333333e-3 |
| Station Two                |    0.082 |    0.093 |    0.081 |  0.085333333 |
| Station Four               |    1.702 |    1.911 |    1.738 |    1.7836667 |
| Station Six                |   29.678 |   29.678 |   29.803 |    29.719667 |
| Station Eight              |  164.477 |  165.993 |  165.677 |    165.38233 |
| Station Ten                |  599.563 |  599.868 |  597.934 |    599.12167 |
| Station Twelfth            | 1741.865 | 1741.334 | 1747.987 |    1743.7287 |
| Two trains same direction  |    0.016 |    0.019 |    0.019 |        0.018 |
| Four trains same direction |      DNF |      DNF |      DNF |          DNF |
| Nærumbanen (2T)            |   24.081 |   24.345 |   24.339 |       24.255 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+----------+---------+-----------|
| Configuration              |   First |   Second |   Third |   Average |
|----------------------------+---------+----------+---------+-----------|
| Example with one train     |   6.000 |    6.016 |   6.020 |     6.012 |
| Example with two trains    |   6.528 |    6.552 |   6.572 | 6.5506667 |
| Shared Segment             |   7.468 |    7.520 |   7.532 | 7.5066667 |
| Large Network              |   8.932 |    8.972 |   8.988 |     8.964 |
| Station One                |   6.484 |    6.524 |   6.536 | 6.5146667 |
| Station Two                |   9.268 |    9.308 |   9.324 |       9.3 |
| Station Four               |  25.792 |   25.880 |  25.896 |    25.856 |
| Station Six                |  69.916 |   70.200 |  70.220 |    70.112 |
| Station Eight              | 158.424 |  158.440 | 158.628 | 158.49733 |
| Station Ten                | 312.972 |  312.984 | 313.116 |   313.024 |
| Station Twelfth            | 723.464 | 1051.300 | 887.412 |   887.392 |
| Two trains same direction  |   7.496 |    7.548 |   7.560 | 7.5346667 |
| Four trains same direction |     DNF |      DNF |     DNF |       DNF |
| Nærumbanen (2T)            |  78.436 |   78.828 |  78.888 | 78.717333 |
|----------------------------+---------+----------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.003 |    0.003 | 2.6666667e-3 |
| Example with two trains    |    0.023 |    0.018 |    0.013 |        0.018 |
| Shared Segment             |     0.01 |     0.01 |     0.01 |         0.01 |
| Large Network              |    0.013 |     0.02 |     0.02 |  0.017666667 |
| Station One                |    0.012 |    0.008 |     0.01 |         0.01 |
| Station Two                |    0.082 |    0.067 |    0.081 |  0.076666667 |
| Station Four               |    1.679 |     1.74 |    1.715 |    1.7113333 |
| Station Six                |   27.342 |   27.453 |   27.331 |    27.375333 |
| Station Eight              |  163.763 |  163.562 |  162.250 |    163.19167 |
| Station Ten                |  590.130 |  587.481 |  588.739 |    588.78333 |
| Station Twelfth            | 1731.068 | 1730.117 | 1726.287 |    1729.1573 |
| Two trains same direction  |    0.018 |    0.017 |    0.018 |  0.017666667 |
| Four trains same direction |      DNF |      DNF |      DNF |          DNF |
| Nærumbanen (2T)            |   23.900 |   23.947 |   23.908 |    23.918333 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.956 |   5.960 |   5.960 | 5.9586667 |
| Example with two trains    |   6.468 |   6.472 |   6.472 | 6.4706667 |
| Shared Segment             |   7.436 |   7.436 |   7.436 |     7.436 |
| Large Network              |   8.888 |   8.904 |   8.908 |       8.9 |
| Station One                |   6.436 |   6.440 |   6.440 | 6.4386667 |
| Station Two                |   9.216 |   9.232 |   9.236 |     9.228 |
| Station Four               |  25.736 |  25.804 |  25.804 | 25.781333 |
| Station Six                |  69.812 |  70.064 |  70.068 | 69.981333 |
| Station Eight              | 158.152 | 158.152 | 158.236 |    158.18 |
| Station Ten                | 312.360 | 312.528 | 312.528 |   312.472 |
| Station Twelfth            | 557.696 | 557.984 | 557.984 |   557.888 |
| Two trains same direction  |   7.460 |   7.460 |   7.460 |      7.46 |
| Four trains same direction |     DNF |     DNF |     DNF |       DNF |
| Nærumbanen (2T)            |  78.392 |  78.704 |  78.704 |      78.6 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)
